package com.helsing.leetcode.util;

import java.io.*;
import java.util.HashMap;
import java.util.Map;

/**
 * @author HelSing
 * @date 2022/2/25
 */
public class MS_DATA {
    public static void main(String[] args) {
        Map<String, String> dataMap = new HashMap<>();
        File jsonFile = new File(json_file);
        try (BufferedReader in = new BufferedReader(
                new InputStreamReader(
                        new FileInputStream(jsonFile)));) {
            System.out.println(in.readLine());
        } catch (Exception e) {
            System.out.println("error");
        }
        String[] lines = origin_data.split("\n");
        for (String line : lines) {
            String[] cols = line.split("\\|\\|");
            String questionId = cols[0].substring(0, cols[0].length() - 1);
            System.out.println(questionId);
        }
    }

    public static String json_file = "/Users/helsing/IdeaProjects/leetcode/src/main/java/com/helsing/leetcode/editor/cn/all.json";

    public static String origin_data =
            "138.||复制带随机指针的链表\t||\t1\n" +
                    "200.||岛屿数量\t||\t2\n" +
                    "1448.||统计二叉树中好节点的数目\t||\t3\n" +
                    "1.||两数之和\t||\t4\n" +
                    "146.||LRU 缓存\t||\t5\n" +
                    "151.||翻转字符串里的单词\t||\t6\n" +
                    "54.||螺旋矩阵\t||\t7\n" +
                    "5.||最长回文子串\t||\t8\n" +
                    "4.||寻找两个正序数组的中位数\t||\t9\n" +
                    "2.||两数相加\t||\t10\n" +
                    "273.||整数转换英文表示\t||\t11\n" +
                    "56.||合并区间\t||\t12\n" +
                    "42.||接雨水\t||\t13\n" +
                    "8.||字符串转换整数 (atoi)\t||\t14\n" +
                    "88.||合并两个有序数组\t||\t15\n" +
                    "33.||搜索旋转排序数组\t||\t16\n" +
                    "121.||买卖股票的最佳时机\t||\t17\n" +
                    "17.||电话号码的字母组合\t||\t18\n" +
                    "253.||会议室 II\t||\t19\n" +
                    "103.||二叉树的锯齿形层序遍历\t||\t20\n" +
                    "297.||二叉树的序列化与反序列化\t||\t21\n" +
                    "13.||罗马数字转整数\t||\t22\n" +
                    "20.||有效的括号\t||\t23\n" +
                    "22.||括号生成\t||\t24\n" +
                    "212.||单词搜索 II\t||\t25\n" +
                    "10.||正则表达式匹配\t||\t26\n" +
                    "206.||反转链表\t||\t27\n" +
                    "53.||最大子数组和\t||\t28\n" +
                    "98.||验证二叉搜索树\t||\t29\n" +
                    "48.||旋转图像\t||\t30\n" +
                    "240.||搜索二维矩阵 II\t||\t31\n" +
                    "21.||合并两个有序链表\t||\t32\n" +
                    "49.||字母异位词分组\t||\t33\n" +
                    "236.||二叉树的最近公共祖先\t||\t34\n" +
                    "445.||两数相加 II\t||\t35\n" +
                    "7.||整数反转\t||\t36\n" +
                    "75.||颜色分类\t||\t37\n" +
                    "3.||无重复字符的最长子串\t||\t38\n" +
                    "23.||合并K个升序链表\t||\t39\n" +
                    "295.||数据流的中位数\t||\t40\n" +
                    "116.||填充每个节点的下一个右侧节点指针\t||\t41\n" +
                    "73.||矩阵置零\t||\t42\n" +
                    "79.||单词搜索\t||\t43\n" +
                    "1822.||数组元素积的符号\t||\t44\n" +
                    "348.||设计井字棋\t||\t45\n" +
                    "41.||缺失的第一个正数\t||\t46\n" +
                    "15.||三数之和\t||\t47\n" +
                    "24.||两两交换链表中的节点\t||\t48\n" +
                    "238.||除自身以外数组的乘积\t||\t49\n" +
                    "43.||字符串相乘\t||\t50\n" +
                    "25.||K 个一组翻转链表\t||\t51\n" +
                    "127.||单词接龙\t||\t52\n" +
                    "443.||压缩字符串\t||\t53\n" +
                    "277.||搜寻名人\t||\t54\n" +
                    "76.||最小覆盖子串\t||\t55\n" +
                    "31.||下一个排列\t||\t56\n" +
                    "224.||基本计算器\t||\t57\n" +
                    "105.||从前序与中序遍历序列构造二叉树\t||\t58\n" +
                    "287.||寻找重复数\t||\t59\n" +
                    "117.||填充每个节点的下一个右侧节点指针 II\t||\t60\n" +
                    "139.||单词拆分\t||\t61\n" +
                    "344.||反转字符串\t||\t62\n" +
                    "155.||最小栈\t||\t63\n" +
                    "173.||二叉搜索树迭代器\t||\t64\n" +
                    "1239.||串联字符串的最大长度\t||\t65\n" +
                    "171.||Excel 表列序号\t||\t66\n" +
                    "218.||天际线问题\t||\t67\n" +
                    "545.||二叉树的边界\t||\t68\n" +
                    "102.||二叉树的层序遍历\t||\t69\n" +
                    "234.||回文链表\t||\t70\n" +
                    "207.||课程表\t||\t71\n" +
                    "36.||有效的数独\t||\t72\n" +
                    "227.||基本计算器 II\t||\t73\n" +
                    "134.||加油站\t||\t74\n" +
                    "168.||Excel表列名称\t||\t75\n" +
                    "165.||比较版本号\t||\t76\n" +
                    "44.||通配符匹配\t||\t77\n" +
                    "153.||寻找旋转排序数组中的最小值\t||\t78\n" +
                    "12.||整数转罗马数字\t||\t79\n" +
                    "322.||零钱兑换\t||\t80\n" +
                    "37.||解数独\t||\t81\n" +
                    "125.||验证回文串\t||\t82\n" +
                    "72.||编辑距离\t||\t83\n" +
                    "140.||单词拆分 II\t||\t84\n" +
                    "402.||移掉 K 位数字\t||\t85\n" +
                    "128.||最长连续序列\t||\t86\n" +
                    "380.||O(1) 时间插入、删除和获取随机元素\t||\t87\n" +
                    "210.||课程表 II\t||\t88\n" +
                    "1647.||字符频次唯一的最小删除次数\t||\t89\n" +
                    "189.||轮转数组\t||\t90\n" +
                    "722.||删除注释\t||\t91\n" +
                    "706.||设计哈希映射\t||\t92\n" +
                    "235.||二叉搜索树的最近公共祖先\t||\t93\n" +
                    "283.||移动零\t||\t94\n" +
                    "557.||反转字符串中的单词 III\t||\t95\n" +
                    "169.||多数元素\t||\t96\n" +
                    "141.||环形链表\t||\t97\n" +
                    "74.||搜索二维矩阵\t||\t98\n" +
                    "387.||字符串中的第一个唯一字符\t||\t99\n" +
                    "124.||二叉树中的最大路径和\t||\t100\n" +
                    "285.||二叉搜索树中的中序后继\t||\t101\n" +
                    "232.||用栈实现队列\t||\t102\n" +
                    "268.||丢失的数字\t||\t103\n" +
                    "994.||腐烂的橘子\t||\t104\n" +
                    "50.||Pow(x, n)\t||\t105\n" +
                    "160.||相交链表\t||\t106\n" +
                    "91.||解码方法\t||\t107\n" +
                    "92.||反转链表 II\t||\t108\n" +
                    "179.||最大数\t||\t109\n" +
                    "204.||计数质数\t||\t110\n" +
                    "71.||简化路径\t||\t111\n" +
                    "394.||字符串解码\t||\t112\n" +
                    "28.||实现 strStr()\t||\t113\n" +
                    "46.||全排列\t||\t114\n" +
                    "186.||翻转字符串里的单词 II\t||\t115\n" +
                    "152.||乘积最大子数组\t||\t116\n" +
                    "11.||盛最多水的容器\t||\t117\n" +
                    "99.||恢复二叉搜索树\t||\t118\n" +
                    "61.||旋转链表\t||\t119\n" +
                    "836.||矩形重叠\t||\t120\n" +
                    "215.||数组中的第K个最大元素\t||\t121\n" +
                    "208.||实现 Trie (前缀树)\t||\t122\n" +
                    "133.||克隆图\t||\t123\n" +
                    "300.||最长递增子序列\t||\t124\n" +
                    "560.||和为 K 的子数组\t||\t125\n" +
                    "19.||删除链表的倒数第 N 个结点\t||\t126\n" +
                    "93.||复原 IP 地址\t||\t127\n" +
                    "450.||删除二叉搜索树中的节点\t||\t128\n" +
                    "642.||设计搜索自动补全系统\t||\t129\n" +
                    "26.||删除有序数组中的重复项\t||\t130\n" +
                    "143.||重排链表\t||\t131\n" +
                    "237.||删除链表中的节点\t||\t132\n" +
                    "51.||N 皇后\t||\t133\n" +
                    "384.||打乱数组\t||\t134\n" +
                    "14.||最长公共前缀\t||\t135\n" +
                    "347.||前 K 个高频元素\t||\t136\n" +
                    "85.||最大矩形\t||\t137\n" +
                    "39.||组合总和\t||\t138\n" +
                    "428.||序列化和反序列化 N 叉树\t||\t139\n" +
                    "636.||函数的独占时间\t||\t140\n" +
                    "118.||杨辉三角\t||\t141\n" +
                    "242.||有效的字母异位词\t||\t142\n" +
                    "1304.||和为零的N个唯一整数\t||\t143\n" +
                    "84.||柱状图中最大的矩形\t||\t144\n" +
                    "419.||甲板上的战舰\t||\t145\n" +
                    "340.||至多包含 K 个不同字符的最长子串\t||\t146\n" +
                    "62.||不同路径\t||\t147\n" +
                    "114.||二叉树展开为链表\t||\t148\n" +
                    "9.||回文数\t||\t149\n" +
                    "239.||滑动窗口最大值\t||\t150\n" +
                    "695.||岛屿的最大面积\t||\t151\n" +
                    "460.||LFU 缓存\t||\t152\n" +
                    "94.||二叉树的中序遍历\t||\t153\n" +
                    "269.||火星词典\t||\t154\n" +
                    "198.||打家劫舍\t||\t155\n" +
                    "403.||青蛙过河\t||\t156\n" +
                    "328.||奇偶链表\t||\t157\n" +
                    "412.||Fizz Buzz\t||\t158\n" +
                    "535.||TinyURL 的加密与解密\t||\t159\n" +
                    "70.||爬楼梯\t||\t160\n" +
                    "863.||二叉树中所有距离为 K 的结点\t||\t161\n" +
                    "59.||螺旋矩阵 II\t||\t162\n" +
                    "32.||最长有效括号\t||\t163\n" +
                    "516.||最长回文子序列\t||\t164\n" +
                    "733.||图像渲染\t||\t165\n" +
                    "378.||有序矩阵中第 K 小的元素\t||\t166\n" +
                    "126.||单词接龙 II\t||\t167\n" +
                    "29.||两数相除\t||\t168\n" +
                    "136.||只出现一次的数字\t||\t169\n" +
                    "621.||任务调度器\t||\t170\n" +
                    "468.||验证IP地址\t||\t171\n" +
                    "38.||外观数列\t||\t172\n" +
                    "148.||排序链表\t||\t173\n" +
                    "69.||x 的平方根\t||\t174\n" +
                    "362.||敲击计数器\t||\t175\n" +
                    "149.||直线上最多的点数\t||\t176\n" +
                    "449.||序列化和反序列化二叉搜索树\t||\t177\n" +
                    "199.||二叉树的右视图\t||\t178\n" +
                    "692.||前K个高频单词\t||\t179\n" +
                    "162.||寻找峰值\t||\t180\n" +
                    "442.||数组中重复的数据\t||\t181\n" +
                    "78.||子集\t||\t182\n" +
                    "1578.||使绳子变成彩色的最短时间\t||\t183\n" +
                    "191.||位1的个数\t||\t184\n" +
                    "64.||最小路径和\t||\t185\n" +
                    "6.||Z 字形变换\t||\t186\n" +
                    "223.||矩形面积\t||\t187\n" +
                    "543.||二叉树的直径\t||\t188\n" +
                    "142.||环形链表 II\t||\t189\n" +
                    "332.||重新安排行程\t||\t190\n" +
                    "229.||求众数 II\t||\t191\n" +
                    "55.||跳跃游戏\t||\t192\n" +
                    "175.||组合两个表\t||\t193\n" +
                    "1246.||删除回文子数组\t||\t194\n" +
                    "214.||最短回文串\t||\t195\n" +
                    "767.||重构字符串\t||\t196\n" +
                    "622.||设计循环队列\t||\t197\n" +
                    "226.||翻转二叉树\t||\t198\n" +
                    "110.||平衡二叉树\t||\t199\n" +
                    "167.||两数之和 II - 输入有序数组\t||\t200\n" +
                    "438.||找到字符串中所有字母异位词\t||\t201\n" +
                    "415.||字符串相加\t||\t202\n" +
                    "572.||另一棵树的子树\t||\t203\n" +
                    "252.||会议室\t||\t204\n" +
                    "716.||最大栈\t||\t205\n" +
                    "529.||扫雷游戏\t||\t206\n" +
                    "101.||对称二叉树\t||\t207\n" +
                    "518.||零钱兑换 II\t||\t208\n" +
                    "176.||第二高的薪水\t||\t209\n" +
                    "45.||跳跃游戏 II\t||\t210\n" +
                    "371.||两整数之和\t||\t211\n" +
                    "108.||将有序数组转换为二叉搜索树\t||\t212\n" +
                    "588.||设计内存文件系统\t||\t213\n" +
                    "221.||最大正方形\t||\t214\n" +
                    "346.||数据流中的移动平均值\t||\t215\n" +
                    "89.||格雷编码\t||\t216\n" +
                    "1344.||时钟指针的夹角\t||\t217\n" +
                    "174.||地下城游戏\t||\t218\n" +
                    "68.||文本左右对齐\t||\t219\n" +
                    "426.||将二叉搜索树转化为排序的双向链表\t||\t220\n" +
                    "708.||循环有序列表的插入\t||\t221\n" +
                    "225.||用队列实现栈\t||\t222\n" +
                    "81.||搜索旋转排序数组 II\t||\t223\n" +
                    "289.||生命游戏\t||\t224\n" +
                    "122.||买卖股票的最佳时机 II\t||\t225\n" +
                    "973.||最接近原点的 K 个点\t||\t226\n" +
                    "83.||删除排序链表中的重复元素\t||\t227\n" +
                    "679.||24 点游戏\t||\t228\n" +
                    "18.||四数之和\t||\t229\n" +
                    "104.||二叉树的最大深度\t||\t230\n" +
                    "628.||三个数的最大乘积\t||\t231\n" +
                    "106.||从中序与后序遍历序列构造二叉树\t||\t232\n" +
                    "123.||买卖股票的最佳时机 III\t||\t233\n" +
                    "217.||存在重复元素\t||\t234\n" +
                    "233.||数字 1 的个数\t||\t235\n" +
                    "315.||计算右侧小于当前元素的个数\t||\t236\n" +
                    "96.||不同的二叉搜索树\t||\t237\n" +
                    "16.||最接近的三数之和\t||\t238\n" +
                    "230.||二叉搜索树中第K小的元素\t||\t239\n" +
                    "794.||有效的井字游戏\t||\t240\n" +
                    "647.||回文子串\t||\t241\n" +
                    "34.||在排序数组中查找元素的第一个和最后一个位置\t||\t242\n" +
                    "150.||逆波兰表达式求值\t||\t243\n" +
                    "63.||不同路径 II\t||\t244\n" +
                    "987.||二叉树的垂序遍历\t||\t245\n" +
                    "739.||每日温度\t||\t246\n" +
                    "86.||分隔链表\t||\t247\n" +
                    "680.||验证回文字符串 Ⅱ\t||\t248\n" +
                    "77.||组合\t||\t249\n" +
                    "448.||找到所有数组中消失的数字\t||\t250\n" +
                    "528.||按权重随机选择\t||\t251\n" +
                    "417.||太平洋大西洋水流问题\t||\t252\n" +
                    "383.||赎金信\t||\t253\n" +
                    "567.||字符串的排列\t||\t254\n" +
                    "349.||两个数组的交集\t||\t255\n" +
                    "113.||路径总和 II\t||\t256\n" +
                    "430.||扁平化多级双向链表\t||\t257\n" +
                    "658.||找到 K 个最接近的元素\t||\t258\n" +
                    "510.||二叉搜索树中的中序后继 II\t||\t259\n" +
                    "1615.||最大网络秩\t||\t260\n" +
                    "112.||路径总和\t||\t261\n" +
                    "721.||账户合并\t||\t262\n" +
                    "329.||矩阵中的最长递增路径\t||\t263\n" +
                    "107.||二叉树的层序遍历 II\t||\t264\n" +
                    "222.||完全二叉树的节点个数\t||\t265\n" +
                    "109.||有序链表转换二叉搜索树\t||\t266\n" +
                    "266.||回文排列\t||\t267\n" +
                    "759.||员工空闲时间\t||\t268\n" +
                    "1236.||网络爬虫\t||\t269\n" +
                    "704.||二分查找\t||\t270\n" +
                    "707.||设计链表\t||\t271\n" +
                    "669.||修剪二叉搜索树\t||\t272\n" +
                    "1275.||找出井字棋的获胜者\t||\t273\n" +
                    "67.||二进制求和\t||\t274\n" +
                    "772.||基本计算器 III\t||\t275\n" +
                    "564.||寻找最近的回文数\t||\t276\n" +
                    "66.||加一\t||\t277\n" +
                    "82.||删除排序链表中的重复元素 II\t||\t278\n" +
                    "135.||分发糖果\t||\t279\n" +
                    "470.||用 Rand7() 实现 Rand10()\t||\t280\n" +
                    "353.||贪吃蛇\t||\t281\n" +
                    "27.||移除元素\t||\t282\n" +
                    "40.||组合总和 II\t||\t283\n" +
                    "694.||不同岛屿的数量\t||\t284\n" +
                    "979.||在二叉树中分配硬币\t||\t285\n" +
                    "137.||只出现一次的数字 II\t||\t286\n" +
                    "1576.||替换所有的问号\t||\t287\n" +
                    "350.||两个数组的交集 II\t||\t288\n" +
                    "416.||分割等和子集\t||\t289\n" +
                    "286.||墙与门\t||\t290\n" +
                    "698.||划分为k个相等的子集\t||\t291\n" +
                    "887.||鸡蛋掉落\t||\t292\n" +
                    "172.||阶乘后的零\t||\t293\n" +
                    "97.||交错字符串\t||\t294\n" +
                    "581.||最短无序连续子数组\t||\t295\n" +
                    "437.||路径总和 III\t||\t296\n" +
                    "304.||二维区域和检索 - 矩阵不可变\t||\t297\n" +
                    "662.||二叉树最大宽度\t||\t298\n" +
                    "876.||链表的中间结点\t||\t299\n" +
                    "203.||移除链表元素\t||\t300\n" +
                    "413.||等差数列划分\t||\t301\n" +
                    "1114.||按序打印\t||\t302\n" +
                    "724.||寻找数组的中心下标\t||\t303\n" +
                    "316.||去除重复字母\t||\t304\n" +
                    "490.||迷宫\t||\t305\n" +
                    "95.||不同的二叉搜索树 II\t||\t306\n" +
                    "611.||有效三角形的个数\t||\t307\n" +
                    "100.||相同的树\t||\t308\n" +
                    "341.||扁平化嵌套列表迭代器\t||\t309\n" +
                    "556.||下一个更大元素 III\t||\t310\n" +
                    "166.||分数到小数\t||\t311\n" +
                    "489.||扫地机器人\t||\t312\n" +
                    "314.||二叉树的垂直遍历\t||\t313\n" +
                    "498.||对角线遍历\t||\t314\n" +
                    "993.||二叉树的堂兄弟节点\t||\t315\n" +
                    "129.||求根节点到叶节点数字之和\t||\t316\n" +
                    "496.||下一个更大元素 I\t||\t317\n" +
                    "1531.||压缩字符串 II\t||\t318\n" +
                    "509.||斐波那契数\t||\t319\n" +
                    "211.||添加与搜索单词 - 数据结构设计\t||\t320\n" +
                    "785.||判断二分图\t||\t321\n" +
                    "1650.||二叉树的最近公共祖先 III\t||\t322\n" +
                    "57.||插入区间\t||\t323\n" +
                    "312.||戳气球\t||\t324\n" +
                    "1480.||一维数组的动态和\t||\t325\n" +
                    "202.||快乐数\t||\t326\n" +
                    "547.||省份数量\t||\t327\n" +
                    "386.||字典序排数\t||\t328\n" +
                    "359.||日志速率限制器\t||\t329\n" +
                    "1197.||进击的骑士\t||\t330\n" +
                    "1386.||安排电影院座位\t||\t331\n" +
                    "264.||丑数 II\t||\t332\n" +
                    "30.||串联所有单词的子串\t||\t333\n" +
                    "130.||被围绕的区域\t||\t334\n" +
                    "158.||用 Read4 读取 N 个字符 II\t||\t335\n" +
                    "895.||最大频率栈\t||\t336\n" +
                    "161.||相隔为 1 的编辑距离\t||\t337\n" +
                    "523.||连续的子数组和\t||\t338\n" +
                    "317.||离建筑物最近的距离\t||\t339\n" +
                    "407.||接雨水 II\t||\t340\n" +
                    "351.||安卓系统手势解锁\t||\t341\n" +
                    "909.||蛇梯棋\t||\t342\n" +
                    "1091.||二进制矩阵中的最短路径\t||\t343\n" +
                    "354.||俄罗斯套娃信封问题\t||\t344\n" +
                    "406.||根据身高重建队列\t||\t345\n" +
                    "703.||数据流中的第 K 大元素\t||\t346\n" +
                    "542.||01 矩阵\t||\t347\n" +
                    "457.||环形数组是否存在循环\t||\t348\n" +
                    "80.||删除有序数组中的重复项 II\t||\t349\n" +
                    "1004.||最大连续1的个数 III\t||\t350\n" +
                    "319.||灯泡开关\t||\t351\n" +
                    "209.||长度最小的子数组\t||\t352\n" +
                    "257.||二叉树的所有路径\t||\t353\n" +
                    "131.||分割回文串\t||\t354\n" +
                    "205.||同构字符串\t||\t355\n" +
                    "977.||有序数组的平方\t||\t356\n" +
                    "159.||至多包含两个不同字符的最长子串\t||\t357\n" +
                    "451.||根据字符出现频率排序\t||\t358\n" +
                    "299.||猜数字游戏\t||\t359\n" +
                    "278.||第一个错误的版本\t||\t360\n" +
                    "47.||全排列 II\t||\t361\n" +
                    "323.||无向图中连通分量的数目\t||\t362\n" +
                    "568.||最大休假天数\t||\t363\n" +
                    "1143.||最长公共子序列\t||\t364\n" +
                    "746.||使用最小花费爬楼梯\t||\t365\n" +
                    "154.||寻找旋转排序数组中的最小值 II\t||\t366\n" +
                    "652.||寻找重复的子树\t||\t367\n" +
                    "525.||连续数组\t||\t368\n" +
                    "844.||比较含退格的字符串\t||\t369\n" +
                    "145.||二叉树的后序遍历\t||\t370\n" +
                    "769.||最多能完成排序的块\t||\t371\n" +
                    "1008.||前序遍历构造二叉搜索树\t||\t372\n" +
                    "462.||最少移动次数使数组元素相等 II\t||\t373\n" +
                    "157.||用 Read4 读取 N 个字符\t||\t374\n" +
                    "705.||设计哈希集合\t||\t375\n" +
                    "270.||最接近的二叉搜索树值\t||\t376\n" +
                    "852.||山脉数组的峰顶索引\t||\t377\n" +
                    "345.||反转字符串中的元音字母\t||\t378\n" +
                    "968.||监控二叉树\t||\t379\n" +
                    "867.||转置矩阵\t||\t380\n" +
                    "414.||第三大的数\t||\t381\n" +
                    "958.||二叉树的完全性检验\t||\t382\n" +
                    "1351.||统计有序矩阵中的负数\t||\t383\n" +
                    "1405.||最长快乐字符串\t||\t384\n" +
                    "591.||标签验证器\t||\t385\n" +
                    "120.||三角形最小路径和\t||\t386\n" +
                    "784.||字母大小写全排列\t||\t387\n" +
                    "260.||只出现一次的数字 III\t||\t388\n" +
                    "1375.||二进制字符串前缀一致的次数\t||\t389\n" +
                    "1047.||删除字符串中的所有相邻重复项\t||\t390\n" +
                    "190.||颠倒二进制位\t||\t391\n" +
                    "494.||目标和\t||\t392\n" +
                    "剑指 Offer 03.||数组中重复的数字\t||\t393\n" +
                    "65.||有效数字\t||\t394\n" +
                    "279.||完全平方数\t||\t395\n" +
                    "463.||岛屿的周长\t||\t396\n" +
                    "409.||最长回文串\t||\t397\n" +
                    "395.||至少有 K 个重复字符的最长子串\t||\t398\n" +
                    "261.||以图判树\t||\t399\n" +
                    "735.||行星碰撞\t||\t400\n" +
                    "849.||到最近的人的最大距离\t||\t401\n" +
                    "144.||二叉树的前序遍历\t||\t402\n" +
                    "119.||杨辉三角 II\t||\t403\n" +
                    "392.||判断子序列\t||\t404\n" +
                    "258.||各位相加\t||\t405\n" +
                    "653.||两数之和 IV - 输入 BST\t||\t406\n" +
                    "243.||最短单词距离\t||\t407\n" +
                    "219.||存在重复元素 II\t||\t408\n" +
                    "1155.||掷骰子的N种方法\t||\t409\n" +
                    "405.||数字转换为十六进制数\t||\t410\n" +
                    "729.||我的日程安排表 I\t||\t411\n" +
                    "768.||最多能完成排序的块 II\t||\t412\n" +
                    "862.||和至少为 K 的最短子数组\t||\t413\n" +
                    "290.||单词规律\t||\t414\n" +
                    "493.||翻转对\t||\t415\n" +
                    "1044.||最长重复子串\t||\t416\n" +
                    "399.||除法求值\t||\t417\n" +
                    "1188.||设计有限阻塞队列\t||\t418\n" +
                    "337.||打家劫舍 III\t||\t419\n" +
                    "934.||最短的桥\t||\t420\n" +
                    "35.||搜索插入位置\t||\t421\n" +
                    "435.||无重叠区间\t||\t422\n" +
                    "292.||Nim 游戏\t||\t423\n" +
                    "678.||有效的括号字符串\t||\t424\n" +
                    "333.||最大 BST 子树\t||\t425\n" +
                    "981.||基于时间的键值存储\t||\t426\n" +
                    "373.||查找和最小的 K 对数字\t||\t427\n" +
                    "771.||宝石与石头\t||\t428\n" +
                    "355.||设计推特\t||\t429\n" +
                    "1466.||重新规划路线\t||\t430\n" +
                    "915.||分割数组\t||\t431\n" +
                    "1195.||交替打印字符串\t||\t432\n" +
                    "617.||合并二叉树\t||\t433\n" +
                    "231.||2 的幂\t||\t434\n" +
                    "503.||下一个更大元素 II\t||\t435\n" +
                    "358.||K 距离间隔重排字符串\t||\t436\n" +
                    "325.||和等于 k 的最长子数组长度\t||\t437\n" +
                    "905.||按奇偶排序数组\t||\t438\n" +
                    "301.||删除无效的括号\t||\t439\n" +
                    "456.||132 模式\t||\t440\n" +
                    "845.||数组中的最长山脉\t||\t441\n" +
                    "147.||对链表进行插入排序\t||\t442\n" +
                    "196.||删除重复的电子邮箱\t||\t443\n" +
                    "60.||排列序列\t||\t444\n" +
                    "935.||骑士拨号器\t||\t445\n" +
                    "365.||水壶问题\t||\t446\n" +
                    "833.||字符串中的查找与替换\t||\t447\n" +
                    "796.||旋转字符串\t||\t448\n" +
                    "432.||全 O(1) 的数据结构\t||\t449\n" +
                    "986.||区间列表的交集\t||\t450\n" +
                    "1249.||移除无效的括号\t||\t451\n" +
                    "LCP 16.||游乐园的游览计划\t||\t452\n" +
                    "2015.||Average Height of Buildings in Each Segment\t||\t453\n" +
                    "2098.||Subsequence of Size K With the Largest Even Sum\t||\t454\n" +
                    "213.||打家劫舍 II\t||\t455\n" +
                    "367.||有效的完全平方数\t||\t456\n" +
                    "532.||数组中的 k-diff 数对\t||\t457\n" +
                    "180.||连续出现的数字\t||\t458\n" +
                    "382.||链表随机节点\t||\t459\n" +
                    "819.||最常见的单词\t||\t460\n" +
                    "164.||最大间距\t||\t461\n" +
                    "702.||搜索长度未知的有序数组\t||\t462\n" +
                    "1094.||拼车\t||\t463\n" +
                    "1353.||最多可以参加的会议数目\t||\t464\n" +
                    "309.||最佳买卖股票时机含冷冻期\t||\t465\n" +
                    "188.||买卖股票的最佳时机 IV\t||\t466\n" +
                    "241.||为运算表达式设计优先级\t||\t467\n" +
                    "284.||顶端迭代器\t||\t468\n" +
                    "480.||滑动窗口中位数\t||\t469\n" +
                    "609.||在系统中查找重复文件\t||\t470\n" +
                    "1185.||一周中的第几天\t||\t471\n" +
                    "582.||杀掉进程\t||\t472\n" +
                    "632.||最小区间\t||\t473\n" +
                    "665.||非递减数列\t||\t474\n" +
                    "1277.||统计全为 1 的正方形子矩阵\t||\t475\n" +
                    "187.||重复的DNA序列\t||\t476\n" +
                    "338.||比特位计数\t||\t477\n" +
                    "538.||把二叉搜索树转换为累加树\t||\t478\n" +
                    "701.||二叉搜索树中的插入操作\t||\t479\n" +
                    "752.||打开转盘锁\t||\t480\n" +
                    "743.||网络延迟时间\t||\t481\n" +
                    "193.||有效电话号码\t||\t482\n" +
                    "1103.||分糖果 II\t||\t483\n" +
                    "1312.||让字符串成为回文串的最少插入次数\t||\t484\n" +
                    "540.||有序数组中的单一元素\t||\t485\n" +
                    "90.||子集 II\t||\t486\n" +
                    "1027.||最长等差数列\t||\t487\n" +
                    "271.||字符串的编码与解码\t||\t488\n" +
                    "282.||给表达式添加运算符\t||\t489\n" +
                    "727.||最小窗口子序列\t||\t490\n" +
                    "182.||查找重复的电子邮箱\t||\t491\n" +
                    "58.||最后一个单词的长度\t||\t492\n" +
                    "1209.||删除字符串中的所有相邻重复项 II\t||\t493\n" +
                    "912.||排序数组\t||\t494\n" +
                    "310.||最小高度树\t||\t495\n" +
                    "1235.||规划兼职工作\t||\t496\n" +
                    "718.||最长重复子数组\t||\t497\n" +
                    "453.||最小操作次数使数组元素相等\t||\t498\n" +
                    "459.||重复的子字符串\t||\t499\n" +
                    "184.||部门工资最高的员工\t||\t500\n" +
                    "1293.||网格中的最短路径\t||\t501\n" +
                    "1032.||字符流\t||\t502\n" +
                    "剑指 Offer 22.||链表中倒数第k个节点\t||\t503\n" +
                    "429.||N 叉树的层序遍历\t||\t504\n" +
                    "1110.||删点成林\t||\t505\n" +
                    "1156.||单字符重复子串的最大长度\t||\t506\n" +
                    "256.||粉刷房子\t||\t507\n" +
                    "228.||汇总区间\t||\t508\n" +
                    "280.||摆动排序\t||\t509\n" +
                    "486.||预测赢家\t||\t510\n" +
                    "216.||组合总和 III\t||\t511\n" +
                    "177.||第N高的薪水\t||\t512\n" +
                    "2052.||将句子分隔成行的最低成本\t||\t513\n" +
                    "651.||4键键盘\t||\t514\n" +
                    "220.||存在重复元素 III\t||\t515\n" +
                    "334.||递增的三元子序列\t||\t516\n" +
                    "1360.||日期之间隔几天\t||\t517\n" +
                    "面试题 01.07.||旋转矩阵\t||\t518\n" +
                    "984.||不含 AAA 或 BBB 的字符串\t||\t519\n" +
                    "181.||超过经理收入的员工\t||\t520\n" +
                    "797.||所有可能的路径\t||\t521\n" +
                    "115.||不同的子序列\t||\t522\n" +
                    "471.||编码最短长度的字符串\t||\t523\n" +
                    "681.||最近时刻\t||\t524\n" +
                    "1644.||二叉树的最近公共祖先 II\t||\t525\n" +
                    "805.||数组的均值分割\t||\t526\n" +
                    "1570.||两个稀疏向量的点积\t||\t527\n" +
                    "192.||统计词频\t||\t528\n" +
                    "474.||一和零\t||\t529\n" +
                    "788.||旋转数字\t||\t530\n" +
                    "939.||最小面积矩形\t||\t531\n" +
                    "1187.||使数组严格递增\t||\t532\n" +
                    "687.||最长同值路径\t||\t533\n" +
                    "696.||计数二进制子串\t||\t534\n" +
                    "246.||中心对称数\t||\t535\n" +
                    "1597.||根据中缀表达式构造二叉表达式树\t||\t536\n" +
                    "1242.||多线程网页爬虫\t||\t537\n" +
                    "485.||最大连续 1 的个数\t||\t538\n" +
                    "376.||摆动序列\t||\t539\n" +
                    "938.||二叉搜索树的范围和\t||\t540\n" +
                    "953.||验证外星语词典\t||\t541\n" +
                    "336.||回文对\t||\t542\n" +
                    "面试题 02.03.||删除中间节点\t||\t543\n" +
                    "1470.||重新排列数组\t||\t544\n" +
                    "1512.||好数对的数目\t||\t545\n" +
                    "面试题 01.01.||判定字符是否唯一\t||\t546\n" +
                    "420.||强密码检验器\t||\t547\n" +
                    "589.||N 叉树的前序遍历\t||\t548\n" +
                    "832.||翻转图像\t||\t549\n" +
                    "390.||消除游戏\t||\t550\n" +
                    "剑指 Offer 24.||反转链表\t||\t551\n" +
                    "343.||整数拆分\t||\t552\n" +
                    "377.||组合总和 Ⅳ\t||\t553\n" +
                    "421.||数组中两个数的最大异或值\t||\t554\n" +
                    "352.||将数据流变为多个不相交区间\t||\t555\n" +
                    "440.||字典序的第K小数字\t||\t556\n" +
                    "1306.||跳跃游戏 III\t||\t557\n" +
                    "992.||K 个不同整数的子数组\t||\t558\n" +
                    "剑指 Offer 09.||用两个栈实现队列\t||\t559\n" +
                    "1653.||使字符串平衡的最少删除次数\t||\t560\n" +
                    "1703.||得到连续 K 个 1 的最少相邻交换次数\t||\t561\n" +
                    "410.||分割数组的最大值\t||\t562\n" +
                    "843.||猜猜这个单词\t||\t563\n" +
                    "1096.||花括号展开 II\t||\t564\n" +
                    "473.||火柴拼正方形\t||\t565\n" +
                    "397.||整数替换\t||\t566\n" +
                    "856.||括号的分数\t||\t567\n" +
                    "997.||找到小镇的法官\t||\t568\n" +
                    "1041.||困于环中的机器人\t||\t569\n" +
                    "1190.||反转每对括号间的子串\t||\t570\n" +
                    "400.||第 N 位数字\t||\t571\n" +
                    "1229.||安排会议日程\t||\t572\n" +
                    "1011.||在 D 天内送达包裹的能力\t||\t573\n" +
                    "1593.||拆分字符串使唯一子字符串的数目最大\t||\t574\n" +
                    "303.||区域和检索 - 数组不可变\t||\t575\n" +
                    "763.||划分字母区间\t||\t576\n" +
                    "剑指 Offer 33.||二叉搜索树的后序遍历序列\t||\t577\n" +
                    "431.||将 N 叉树编码为二叉树\t||\t578\n" +
                    "461.||汉明距离\t||\t579\n" +
                    "111.||二叉树的最小深度\t||\t580\n" +
                    "650.||只有两个键的键盘\t||\t581\n" +
                    "281.||锯齿迭代器\t||\t582\n" +
                    "888.||公平的糖果交换\t||\t583\n" +
                    "674.||最长连续递增序列\t||\t584\n" +
                    "731.||我的日程安排表 II\t||\t585\n" +
                    "949.||给定数字能组成的最大时间\t||\t586\n" +
                    "980.||不同路径 III\t||\t587\n" +
                    "974.||和可被 K 整除的子数组\t||\t588\n" +
                    "1254.||统计封闭岛屿的数目\t||\t589\n" +
                    "1232.||缀点成线\t||\t590\n" +
                    "1573.||分割字符串的方案数\t||\t591\n" +
                    "1672.||最富有客户的资产总量\t||\t592\n" +
                    "1854.||人口最多的年份\t||\t593\n" +
                    "673.||最长递增子序列的个数\t||\t594\n" +
                    "1122.||数组的相对排序\t||\t595\n" +
                    "606.||根据二叉树创建字符串\t||\t596\n" +
                    "458.||可怜的小猪\t||\t597\n" +
                    "424.||替换后的最长重复字符\t||\t598\n" +
                    "505.||迷宫 II\t||\t599\n" +
                    "714.||买卖股票的最佳时机含手续费\t||\t600\n" +
                    "306.||累加数\t||\t601\n" +
                    "517.||超级洗衣机\t||\t602\n" +
                    "818.||赛车\t||\t603\n" +
                    "1136.||平行课程\t||\t604\n" +
                    "剑指 Offer 45.||把数组排成最小的数\t||\t605\n" +
                    "1453.||圆形靶内的最大飞镖数量\t||\t606\n" +
                    "剑指 Offer 26.||树的子结构\t||\t607\n" +
                    "1058.||最小化舍入误差以满足目标\t||\t608\n" +
                    "726.||原子的数量\t||\t609\n" +
                    "531.||孤独像素 I\t||\t610\n" +
                    "剑指 Offer 62.||圆圈中最后剩下的数字\t||\t611\n" +
                    "剑指 Offer 37.||序列化二叉树\t||\t612\n" +
                    "740.||删除并获得点数\t||\t613\n" +
                    "1198.||找出所有行中最小公共元素\t||\t614\n" +
                    "1206.||设计跳表\t||\t615\n" +
                    "1359.||有效的快递序列数目\t||\t616\n" +
                    "305.||岛屿数量 II\t||\t617\n" +
                    "324.||摆动排序 II\t||\t618\n" +
                    "829.||连续整数求和\t||\t619\n" +
                    "890.||查找和替换模式\t||\t620\n" +
                    "878.||第 N 个神奇数字\t||\t621\n" +
                    "1382.||将二叉搜索树变平衡\t||\t622\n" +
                    "1329.||将矩阵按对角线排序\t||\t623\n" +
                    "剑指 Offer 56 - I.||数组中数字出现的次数\t||\t624\n" +
                    "剑指 Offer 29.||顺时针打印矩阵\t||\t625\n" +
                    "917.||仅仅反转字母\t||\t626\n" +
                    "871.||最低加油次数\t||\t627\n" +
                    "515.||在每个树行中找最大值\t||\t628\n" +
                    "725.||分隔链表\t||\t629\n" +
                    "388.||文件的最长绝对路径\t||\t630\n" +
                    "686.||重复叠加字符串匹配\t||\t631\n" +
                    "779.||第K个语法符号\t||\t632\n" +
                    "795.||区间子数组个数\t||\t633\n" +
                    "1314.||矩阵区域和\t||\t634\n" +
                    "464.||我能赢吗\t||\t635\n" +
                    "1358.||包含所有三种字符的子字符串数目\t||\t636\n" +
                    "700.||二叉搜索树中的搜索\t||\t637\n" +
                    "1429.||第一个唯一数字\t||\t638\n" +
                    "690.||员工的重要性\t||\t639\n" +
                    "1325.||删除给定值的叶子节点\t||\t640\n" +
                    "剑指 Offer 06.||从尾到头打印链表\t||\t641\n" +
                    "951.||翻转等价二叉树\t||\t642\n" +
                    "1681.||最小不兼容性\t||\t643\n" +
                    "剑指 Offer 46.||把数字翻译成字符串\t||\t644\n" +
                    "1123.||最深叶节点的最近公共祖先\t||\t645\n" +
                    "剑指 Offer 25.||合并两个排序的链表\t||\t646\n" +
                    "1031.||两个非重叠子数组的最大和\t||\t647\n" +
                    "1095.||山脉数组中查找目标值\t||\t648\n" +
                    "1104.||二叉树寻路\t||\t649\n" +
                    "245.||最短单词距离 III\t||\t650\n" +
                    "500.||键盘行\t||\t651\n" +
                    "623.||在二叉树中增加一行\t||\t652\n" +
                    "959.||由斜杠划分区域\t||\t653\n" +
                    "178.||分数排名\t||\t654\n" +
                    "1108.||IP 地址无效化\t||\t655\n" +
                    "536.||从字符串生成二叉树\t||\t656\n" +
                    "657.||机器人能否返回原点\t||\t657\n" +
                    "847.||访问所有节点的最短路径\t||\t658\n" +
                    "1268.||搜索推荐系统\t||\t659\n" +
                    "907.||子数组的最小值之和\t||\t660\n" +
                    "1000.||合并石头的最低成本\t||\t661\n" +
                    "1315.||祖父节点值为偶数的节点和\t||\t662\n" +
                    "896.||单调数列\t||\t663\n" +
                    "1161.||最大层内元素和\t||\t664\n" +
                    "剑指 Offer 43.||1～n 整数中 1 出现的次数\t||\t665\n" +
                    "1518.||换酒问题\t||\t666\n" +
                    "870.||优势洗牌\t||\t667\n" +
                    "919.||完全二叉树插入器\t||\t668\n" +
                    "1291.||顺次数\t||\t669\n" +
                    "1319.||连通网络的操作次数\t||\t670\n" +
                    "1089.||复写零\t||\t671\n" +
                    "1884.||鸡蛋掉落-两枚鸡蛋\t||\t672\n" +
                    "927.||三等分\t||\t673\n" +
                    "501.||二叉搜索树中的众数\t||\t674\n" +
                    "605.||种花问题\t||\t675\n" +
                    "1026.||节点与其祖先之间的最大差值\t||\t676\n" +
                    "307.||区域和检索 - 数组可修改\t||\t677\n" +
                    "821.||字符的最短距离\t||\t678\n" +
                    "1029.||两地调度\t||\t679\n" +
                    "507.||完美数\t||\t680\n" +
                    "738.||单调递增的数字\t||\t681\n" +
                    "剑指 Offer 59 - II.||队列的最大值\t||\t682\n" +
                    "面试题 01.06.||字符串压缩\t||\t683\n" +
                    "面试题 10.01.||合并排序的数组\t||\t684\n" +
                    "630.||课程表 III\t||\t685\n" +
                    "1302.||层数最深叶子节点的和\t||\t686\n" +
                    "491.||递增子序列\t||\t687\n" +
                    "面试题 01.04.||回文排列\t||\t688\n" +
                    "770.||基本计算器 IV\t||\t689\n" +
                    "LCP 35.||电动车游城市\t||\t690\n" +
                    "1971.||寻找图中是否存在路径\t||\t691\n" +
                    "1392.||最长快乐前缀\t||\t692\n" +
                    "943.||最短超级串\t||\t693\n" +
                    "730.||统计不同回文子序列\t||\t694\n" +
                    "1676.||二叉树的最近公共祖先 IV\t||\t695\n" +
                    "541.||反转字符串 II\t||\t696\n" +
                    "946.||验证栈序列\t||\t697\n" +
                    "369.||给单链表加一\t||\t698\n" +
                    "646.||最长数对链\t||\t699\n" +
                    "1116.||打印零与奇偶数\t||\t700\n" +
                    "318.||最大单词长度乘积\t||\t701\n" +
                    "1603.||设计停车系统\t||\t702\n" +
                    "剑指 Offer 42.||连续子数组的最大和\t||\t703\n" +
                    "剑指 Offer 04.||二维数组中的查找\t||\t704\n" +
                    "1273.||删除树节点\t||\t705\n" +
                    "1131.||绝对值表达式的最大值\t||\t706\n" +
                    "645.||错误的集合\t||\t707\n" +
                    "1326.||灌溉花园的最少水龙头数目\t||\t708\n" +
                    "262.||行程和用户\t||\t709\n" +
                    "剑指 Offer 21.||调整数组顺序使奇数位于偶数前面\t||\t710\n" +
                    "剑指 Offer 66.||构建乘积数组\t||\t711\n" +
                    "1411.||给 N x 3 网格图涂色的方案数\t||\t712\n" +
                    "LCP 13.||寻宝\t||\t713\n" +
                    "1547.||切棍子的最小成本\t||\t714\n" +
                    "764.||最大加号标志\t||\t715\n" +
                    "1586.||二叉搜索树迭代器 II\t||\t716\n" +
                    "755.||倒水\t||\t717\n" +
                    "1904.||你完成的完整对局数\t||\t718\n" +
                    "2127.||参加会议的最多员工数\t||\t719\n" +
                    "剑指 Offer 07.||重建二叉树\t||\t720\n" +
                    "剑指 Offer 54.||二叉搜索树的第k大节点\t||\t721\n" +
                    "612.||平面上的最近距离\t||\t722\n" +
                    "604.||迭代压缩字符串\t||\t723\n" +
                    "683.||K 个关闭的灯泡\t||\t724\n" +
                    "828.||统计子串中的唯一字符\t||\t725\n" +
                    "1537.||最大得分\t||\t726\n" +
                    "剑指 Offer 58 - II.||左旋转字符串\t||\t727\n" +
                    "1093.||大样本统计\t||\t728\n" +
                    "1007.||行相等的最少多米诺旋转\t||\t729\n" +
                    "719.||找出第 k 小的距离对\t||\t730\n" +
                    "1324.||竖直打印单词\t||\t731\n" +
                    "1369.||获取最近第二次的活动\t||\t732\n" +
                    "1381.||设计一个支持增量操作的栈\t||\t733\n" +
                    "629.||K个逆序对数组\t||\t734\n" +
                    "842.||将数组拆分成斐波那契序列\t||\t735\n" +
                    "1575.||统计所有可行路径\t||\t736\n" +
                    "321.||拼接最大数\t||\t737\n" +
                    "1734.||解码异或后的排列\t||\t738\n" +
                    "剑指 Offer 52.||两个链表的第一个公共节点\t||\t739\n" +
                    "672.||灯泡开关 Ⅱ\t||\t740\n" +
                    "308.||二维区域和检索 - 可变\t||\t741\n" +
                    "427.||建立四叉树\t||\t742\n" +
                    "663.||均匀树划分\t||\t743\n" +
                    "250.||统计同值子树\t||\t744\n" +
                    "600.||不含连续1的非负整数\t||\t745\n" +
                    "790.||多米诺和托米诺平铺\t||\t746\n" +
                    "1140.||石子游戏 II\t||\t747\n" +
                    "1067.||范围内的数字计数\t||\t748\n" +
                    "961.||在长度 2N 的数组中找出重复 N 次的元素\t||\t749\n" +
                    "1415.||长度为 n 的开心字符串中字典序第 k 小的字符串\t||\t750\n" +
                    "682.||棒球比赛\t||\t751\n" +
                    "LCP 26.||导航装置\t||\t752\n" +
                    "1637.||两点之间不包含任何点的最宽垂直面积\t||\t753\n" +
                    "1638.||统计只差一个字符的子串数目\t||\t754\n" +
                    "LCP 18.||早餐组合\t||\t755\n" +
                    "455.||分发饼干\t||\t756\n" +
                    "475.||供暖器\t||\t757\n" +
                    "1504.||统计全 1 子矩形\t||\t758\n" +
                    "1074.||元素和为目标值的子矩阵数量\t||\t759\n" +
                    "1522.||N 叉树的直径\t||\t760\n" +
                    "742.||二叉树最近的叶节点\t||\t761\n" +
                    "1780.||判断一个数字是否可以表示成三的幂的和\t||\t762\n" +
                    "1834.||单线程 CPU\t||\t763\n" +
                    "1778.||未知网格中的最短路径\t||\t764\n" +
                    "1762.||能看到海景的建筑物\t||\t765\n" +
                    "880.||索引处的解码字符串\t||\t766\n" +
                    "2034.||股票价格波动\t||\t767\n" +
                    "2107.||Number of Unique Flavors After Sharing K Candies\t||\t768\n" +
                    "剑指 Offer 51.||数组中的逆序对\t||\t769\n" +
                    "423.||从英文中重建数字\t||\t770\n" +
                    "1053.||交换一次的先前排列\t||\t771\n" +
                    "546.||移除盒子\t||\t772\n" +
                    "247.||中心对称数 II\t||\t773\n" +
                    "978.||最长湍流子数组\t||\t774\n" +
                    "1145.||二叉树着色游戏\t||\t775\n" +
                    "1186.||删除一次得到子数组最大和\t||\t776\n" +
                    "398.||随机数索引\t||\t777\n" +
                    "834.||树中距离之和\t||\t778\n" +
                    "1285.||找到连续区间的开始和结束数字\t||\t779\n" +
                    "1016.||子串能表示从 1 到 N 数字的二进制串\t||\t780\n" +
                    "1151.||最少交换次数来组合所有的 1\t||\t781\n" +
                    "1373.||二叉搜索子树的最大键值和\t||\t782\n" +
                    "1469.||寻找所有的独生节点\t||\t783\n" +
                    "面试题 02.01.||移除重复节点\t||\t784\n" +
                    "1528.||重新排列字符串\t||\t785\n" +
                    "1497.||检查数组对是否可以被 k 整除\t||\t786\n" +
                    "1694.||重新格式化电话号码\t||\t787\n" +
                    "1721.||交换链表中的节点\t||\t788\n" +
                    "1022.||从根到叶的二进制数之和\t||\t789\n" +
                    "765.||情侣牵手\t||\t790\n" +
                    "1028.||从先序遍历还原二叉树\t||\t791\n" +
                    "1723.||完成所有工作的最短时间\t||\t792\n" +
                    "1546.||和为目标值且不重叠的非空子数组的最大数目\t||\t793\n" +
                    "1641.||统计字典序元音字符串的数目\t||\t794\n" +
                    "1567.||乘积为正数的最长子数组长度\t||\t795\n" +
                    "1861.||旋转盒子\t||\t796\n" +
                    "1910.||删除一个字符串中所有出现的给定子字符串\t||\t797\n" +
                    "2096.||从二叉树一个节点到另一个节点每一步的方向\t||\t798\n" +
                    "1203.||项目管理\t||\t799\n" +
                    "465.||最优账单平衡\t||\t800\n" +
                    "676.||实现一个魔法字典\t||\t801\n" +
                    "942.||增减字符串匹配\t||\t802\n" +
                    "524.||通过删除字母匹配到字典里最长单词\t||\t803\n" +
                    "467.||环绕字符串中唯一的子字符串\t||\t804\n" +
                    "263.||丑数\t||\t805\n" +
                    "298.||二叉树最长连续序列\t||\t806\n" +
                    "508.||出现次数最多的子树元素和\t||\t807\n" +
                    "1160.||拼写单词\t||\t808\n" +
                    "1282.||用户分组\t||\t809\n" +
                    "873.||最长的斐波那契子序列的长度\t||\t810\n" +
                    "853.||车队\t||\t811\n" +
                    "809.||情感丰富的文字\t||\t812\n" +
                    "面试题 17.24.||最大子矩阵\t||\t813\n" +
                    "面试题 04.10.||检查子树\t||\t814\n" +
                    "面试题 04.08.||首个共同祖先\t||\t815\n" +
                    "393.||UTF-8 编码验证\t||\t816\n" +
                    "1079.||活字印刷\t||\t817\n" +
                    "792.||匹配子序列的单词数\t||\t818\n" +
                    "1051.||高度检查器\t||\t819\n" +
                    "1389.||按既定顺序创建目标数组\t||\t820\n" +
                    "1367.||二叉树中的列表\t||\t821\n" +
                    "1154.||一年中的第几天\t||\t822\n" +
                    "1310.||子数组异或查询\t||\t823\n" +
                    "1588.||所有奇数长度子数组的和\t||\t824\n" +
                    "面试题 08.04.||幂集\t||\t825\n" +
                    "991.||坏了的计算器\t||\t826\n" +
                    "925.||长按键入\t||\t827\n" +
                    "841.||钥匙和房间\t||\t828\n" +
                    "327.||区间和的个数\t||\t829\n" +
                    "1631.||最小体力消耗路径\t||\t830\n" +
                    "1128.||等价多米诺骨牌对的数量\t||\t831\n" +
                    "1048.||最长字符串链\t||\t832\n" +
                    "1742.||盒子中小球的最大数量\t||\t833\n" +
                    "539.||最小时间差\t||\t834\n" +
                    "1222.||可以攻击国王的皇后\t||\t835\n" +
                    "1013.||将数组分成和相等的三个部分\t||\t836\n" +
                    "156.||上下翻转二叉树\t||\t837\n" +
                    "385.||迷你语法分析器\t||\t838\n" +
                    "551.||学生出勤记录 I\t||\t839\n" +
                    "575.||分糖果\t||\t840\n" +
                    "783.||二叉搜索树节点最小距离\t||\t841\n" +
                    "807.||保持城市天际线\t||\t842\n" +
                    "1281.||整数的各位积和之差\t||\t843\n" +
                    "1352.||最后 K 个数的乘积\t||\t844\n" +
                    "剑指 Offer 14- I.||剪绳子\t||\t845\n" +
                    "1042.||不邻接植花\t||\t846\n" +
                    "1365.||有多少小于当前数字的数字\t||\t847\n" +
                    "950.||按递增顺序显示卡牌\t||\t848\n" +
                    "面试题 08.11.||硬币\t||\t849\n" +
                    "1221.||分割平衡字符串\t||\t850\n" +
                    "剑指 Offer 65.||不用加减乘除做加法\t||\t851\n" +
                    "面试题19.||正则表达式匹配\t||\t852\n" +
                    "1486.||数组异或操作\t||\t853\n" +
                    "1374.||生成每种字符都是奇数个的字符串\t||\t854\n" +
                    "1618.||找出适应屏幕的最大字号\t||\t855\n" +
                    "剑指 Offer 49.||丑数\t||\t856\n" +
                    "1705.||吃苹果的最大数目\t||\t857\n" +
                    "1472.||设计浏览器历史记录\t||\t858\n" +
                    "1233.||删除子文件夹\t||\t859\n" +
                    "面试题 17.21.||直方图的水量\t||\t860\n" +
                    "587.||安装栅栏\t||\t861\n" +
                    "1541.||平衡括号字符串的最少插入次数\t||\t862\n" +
                    "2124.||检查是否所有 A 都在 B 之前\t||\t863\n" +
                    "剑指 Offer 30.||包含min函数的栈\t||\t864\n" +
                    "剑指 Offer 10- II.||青蛙跳台阶问题\t||\t865\n" +
                    "366.||寻找二叉树的叶子节点\t||\t866\n" +
                    "811.||子域名访问计数\t||\t867\n" +
                    "面试题 01.08.||零矩阵\t||\t868\n" +
                    "1200.||最小绝对差\t||\t869\n" +
                    "626.||换座位\t||\t870\n" +
                    "面试题 16.25.||LRU 缓存\t||\t871\n" +
                    "1464.||数组中两元素的最大乘积\t||\t872\n" +
                    "969.||煎饼排序\t||\t873\n" +
                    "356.||直线镜像\t||\t874\n" +
                    "剑指 Offer 53 - II.||0～n-1中缺失的数字\t||\t875\n" +
                    "1152.||用户网站访问行为分析\t||\t876\n" +
                    "595.||大的国家\t||\t877\n" +
                    "697.||数组的度\t||\t878\n" +
                    "剑指 Offer 44.||数字序列中某一位的数字\t||\t879\n" +
                    "654.||最大二叉树\t||\t880\n" +
                    "558.||四叉树交集\t||\t881\n" +
                    "248.||中心对称数 III\t||\t882\n" +
                    "剑指 Offer 56 - II.||数组中数字出现的次数 II\t||\t883\n" +
                    "1523.||在区间范围内统计奇数数目\t||\t884\n" +
                    "LCP 15.||游乐园的迷宫\t||\t885\n" +
                    "1245.||树的直径\t||\t886\n" +
                    "剑指 Offer 15.||二进制中1的个数\t||\t887\n" +
                    "1634.||求两个多项式链表的和\t||\t888\n" +
                    "1896.||反转表达式值的最少操作次数\t||\t889\n" +
                    "751.||IP 到 CIDR\t||\t890\n" +
                    "583.||两个字符串的删除操作\t||\t891\n" +
                    "剑指 Offer 20.||表示数值的字符串\t||\t892\n" +
                    "635.||设计日志存储系统\t||\t893\n" +
                    "1610.||可见点的最大数目\t||\t894\n" +
                    "1806.||还原排列的最少操作步数\t||\t895\n" +
                    "1269.||停在原地的方案数\t||\t896\n" +
                    "404.||左叶子之和\t||\t897\n" +
                    "剑指 Offer 55 - II.||平衡二叉树\t||\t898\n" +
                    "剑指 Offer 36.||二叉搜索树与双向链表\t||\t899\n" +
                    "剑指 Offer 05.||替换空格\t||\t900\n" +
                    "715.||Range 模块\t||\t901\n" +
                    "320.||列举单词的全部缩写\t||\t902\n" +
                    "1564.||把箱子放进仓库里 I\t||\t903\n" +
                    "1483.||树节点的第 K 个祖先\t||\t904\n" +
                    "803.||打砖块\t||\t905\n" +
                    "1348.||推文计数\t||\t906\n" +
                    "717.||1 比特与 2 比特字符\t||\t907\n" +
                    "1340.||跳跃游戏 V\t||\t908\n" +
                    "1189.||“气球” 的最大数量\t||\t909\n" +
                    "1864.||构成交替字符串需要的最小交换次数\t||\t910\n" +
                    "737.||句子相似性 II\t||\t911\n" +
                    "1062.||最长重复子串\t||\t912\n" +
                    "272.||最接近的二叉搜索树值 II\t||\t913\n" +
                    "255.||验证前序遍历序列二叉搜索树\t||\t914\n" +
                    "335.||路径交叉\t||\t915\n" +
                    "760.||找出变位映射\t||\t916\n" +
                    "1255.||得分最高的单词集合\t||\t917\n" +
                    "1339.||分裂二叉树的最大乘积\t||\t918\n" +
                    "1372.||二叉树中的最长交错路径\t||\t919\n" +
                    "1474.||删除链表 M 个节点之后的 N 个节点\t||\t920\n" +
                    "1494.||并行课程 II\t||\t921\n" +
                    "1228.||等差数列中缺失的数字\t||\t922\n" +
                    "1366.||通过投票对团队排名\t||\t923\n" +
                    "剑指 Offer 57.||和为s的两个数字\t||\t924\n" +
                    "1361.||验证二叉树\t||\t925\n" +
                    "1823.||找出游戏的获胜者\t||\t926\n" +
                    "1335.||工作计划的最低难度\t||\t927\n" +
                    "1626.||无矛盾的最佳球队\t||\t928\n" +
                    "LCP 20.||快速公交\t||\t929\n" +
                    "1509.||三次操作后最大值与最小值的最小差\t||\t930\n" +
                    "剑指 Offer 50.||第一个只出现一次的字符\t||\t931\n" +
                    "956.||最高的广告牌\t||\t932\n" +
                    "1318.||或运算的最小翻转次数\t||\t933\n" +
                    "754.||到达终点数字\t||\t934\n" +
                    "801.||使序列递增的最小交换次数\t||\t935\n" +
                    "1017.||负二进制转换\t||\t936\n" +
                    "1510.||石子游戏 IV\t||\t937\n" +
                    "937.||重新排列日志文件\t||\t938\n" +
                    "813.||最大平均值和的分组\t||\t939\n" +
                    "814.||二叉树剪枝\t||\t940\n" +
                    "1664.||生成平衡数组的方案数\t||\t941\n" +
                    "446.||等差数列划分 II - 子序列\t||\t942\n" +
                    "2028.||找出缺失的观测数据\t||\t943\n" +
                    "668.||乘法表中第k小的数\t||\t944\n" +
                    "1036.||逃离大迷宫\t||\t945\n" +
                    "861.||翻转矩阵后的得分\t||\t946\n" +
                    "897.||递增顺序搜索树\t||\t947\n" +
                    "1184.||公交站间的距离\t||\t948\n" +
                    "1024.||视频拼接\t||\t949\n" +
                    "1117.||H2O 生成\t||\t950\n" +
                    "433.||最小基因变化\t||\t951\n" +
                    "848.||字母移位\t||\t952\n" +
                    "面试题 08.02.||迷路的机器人\t||\t953\n" +
                    "1018.||可被 5 整除的二进制前缀\t||\t954\n" +
                    "1274.||矩形内船只的数目\t||\t955\n" +
                    "1442.||形成两个异或相等数组的三元组数目\t||\t956\n" +
                    "面试题 17.13.||恢复空格\t||\t957\n" +
                    "面试题 17.12.||BiNode\t||\t958\n" +
                    "777.||在LR字符串中交换相邻字符\t||\t959\n" +
                    "1556.||千位分隔数\t||\t960\n" +
                    "1553.||吃掉 N 个橘子的最少天数\t||\t961\n" +
                    "1376.||通知所有员工所需的时间\t||\t962\n" +
                    "1043.||分隔数组以得到最大和\t||\t963\n" +
                    "1290.||二进制链表转整数\t||\t964\n" +
                    "778.||水位上升的泳池中游泳\t||\t965\n" +
                    "1438.||绝对差不超过限制的最长连续子数组\t||\t966\n" +
                    "924.||尽量减少恶意软件的传播\t||\t967\n" +
                    "875.||爱吃香蕉的珂珂\t||\t968\n" +
                    "1963.||使字符串平衡的最小交换次数\t||\t969\n" +
                    "265.||粉刷房子 II\t||\t970\n" +
                    "313.||超级丑数\t||\t971\n" +
                    "357.||计算各个位数不同的数字个数\t||\t972\n" +
                    "481.||神奇字符串\t||\t973\n" +
                    "520.||检测大写字母\t||\t974\n" +
                    "526.||优美的排列\t||\t975\n" +
                    "616.||给字符串添加加粗标签\t||\t976\n" +
                    "659.||分割数组为连续子序列\t||\t977\n" +
                    "709.||转换成小写字母\t||\t978\n" +
                    "999.||可以被一步捕获的棋子数\t||\t979\n" +
                    "1292.||元素和小于等于阈值的正方形的最大边长\t||\t980\n" +
                    "1371.||每个元音包含偶数次的最长子字符串\t||\t981\n" +
                    "1287.||有序数组中出现次数超过25%的元素\t||\t982\n" +
                    "面试题 01.02.||判定是否互为字符重排\t||\t983\n" +
                    "1332.||删除回文子序列\t||\t984\n" +
                    "1139.||最大的以 1 为边界的正方形\t||\t985\n" +
                    "1370.||上升下降字符串\t||\t986\n" +
                    "894.||所有可能的满二叉树\t||\t987\n" +
                    "1388.||3n 块披萨\t||\t988\n" +
                    "962.||最大宽度坡\t||\t989\n" +
                    "面试题 10.11.||峰与谷\t||\t990\n" +
                    "941.||有效的山脉数组\t||\t991\n" +
                    "530.||二叉搜索树的最小绝对差\t||\t992\n" +
                    "1177.||构建回文串检测\t||\t993\n" +
                    "1437.||是否所有 1 都至少相隔 k 个元素\t||\t994\n" +
                    "面试题 08.06.||汉诺塔问题\t||\t995\n" +
                    "627.||变更性别\t||\t996\n" +
                    "1700.||无法吃午餐的学生数量\t||\t997\n" +
                    "1572.||矩阵对角线元素的和\t||\t998\n" +
                    "441.||排列硬币\t||\t999\n" +
                    "846.||一手顺子\t||\t1000\n" +
                    "339.||嵌套列表权重和\t||\t1001\n" +
                    "1363.||形成三的最大倍数\t||\t1002\n" +
                    "1758.||生成交替二进制字符串的最少操作数\t||\t1003\n" +
                    "面试题 16.17.||连续数列\t||\t1004\n" +
                    "1678.||设计 Goal 解析器\t||\t1005\n" +
                    "面试题 08.13.||堆箱子\t||\t1006\n" +
                    "1901.||找出顶峰元素 II\t||\t1007\n" +
                    "1481.||不同整数的最少数目\t||\t1008\n" +
                    "1941.||检查是否所有字符出现次数相同\t||\t1009\n" +
                    "487.||最大连续1的个数 II\t||\t1010\n" +
                    "1551.||使数组中所有元素相等的最小操作数\t||\t1011\n" +
                    "1267.||统计参与通信的服务器\t||\t1012\n" +
                    "967.||连续差相同的数字\t||\t1013\n" +
                    "631.||设计 Excel 求和公式\t||\t1014\n" +
                    "782.||变为棋盘\t||\t1015\n" +
                    "881.||救生艇\t||\t1016\n" +
                    "766.||托普利茨矩阵\t||\t1017\n" +
                    "478.||在圆内随机生成点\t||\t1018\n" +
                    "1049.||最后一块石头的重量 II\t||\t1019\n" +
                    "1299.||将每个元素替换为右侧最大元素\t||\t1020\n" +
                    "521.||最长特殊序列 Ⅰ\t||\t1021\n" +
                    "914.||卡牌分组\t||\t1022\n" +
                    "面试题 17.18.||最短超串\t||\t1023\n" +
                    "面试题 03.02.||栈的最小值\t||\t1024\n" +
                    "598.||范围求和 II\t||\t1025\n" +
                    "剑指 Offer 60.||n个骰子的点数\t||\t1026\n" +
                    "933.||最近的请求次数\t||\t1027\n" +
                    "1446.||连续字符\t||\t1028\n" +
                    "面试题 08.09.||括号\t||\t1029\n" +
                    "面试题 08.14.||布尔运算\t||\t1030\n" +
                    "1021.||删除最外层的括号\t||\t1031\n" +
                    "865.||具有所有最深节点的最小子树\t||\t1032\n" +
                    "599.||两个列表的最小索引总和\t||\t1033\n" +
                    "1450.||在既定时间做作业的学生人数\t||\t1034\n" +
                    "1088.||易混淆数 II\t||\t1035\n" +
                    "781.||森林中的兔子\t||\t1036\n" +
                    "1227.||飞机座位分配概率\t||\t1037\n" +
                    "1838.||最高频元素的频数\t||\t1038\n" +
                    "434.||字符串中的单词数\t||\t1039\n" +
                    "1288.||删除被覆盖区间\t||\t1040\n" +
                    "面试题 02.04.||分割链表\t||\t1041\n" +
                    "827.||最大人工岛\t||\t1042\n" +
                    "1338.||数组大小减半\t||\t1043\n" +
                    "594.||最长和谐子序列\t||\t1044\n" +
                    "1046.||最后一块石头的重量\t||\t1045\n" +
                    "1689.||十-二进制数的最少数目\t||\t1046\n" +
                    "1688.||比赛中的配对次数\t||\t1047\n" +
                    "1720.||解码异或后的数组\t||\t1048\n" +
                    "483.||最小好进制\t||\t1049\n" +
                    "513.||找树左下角的值\t||\t1050\n" +
                    "374.||猜数字大小\t||\t1051\n" +
                    "1258.||近义词句子\t||\t1052\n" +
                    "774.||最小化去加油站的最大距离\t||\t1053\n" +
                    "剑指 Offer 58 - I.||翻转单词顺序\t||\t1054\n" +
                    "面试题 04.03.||特定深度节点链表\t||\t1055\n" +
                    "976.||三角形的最大周长\t||\t1056\n" +
                    "1396.||设计地铁系统\t||\t1057\n" +
                    "723.||粉碎糖果\t||\t1058\n" +
                    "195.||第十行\t||\t1059\n" +
                    "面试题 01.05.||一次编辑\t||\t1060\n" +
                    "剑指 Offer 64.||求1+2+…+n\t||\t1061\n" +
                    "1505.||最多 K 次交换相邻数位后得到的最小整数\t||\t1062\n" +
                    "面试题 10.03.||搜索旋转数组\t||\t1063\n" +
                    "1215.||步进数\t||\t1064\n" +
                    "剑指 Offer 68 - II.||二叉树的最近公共祖先\t||\t1065\n" +
                    "剑指 Offer 31.||栈的压入、弹出序列\t||\t1066\n" +
                    "1342.||将数字变成 0 的操作次数\t||\t1067\n" +
                    "面试题 02.02.||返回倒数第 k 个节点\t||\t1068\n" +
                    "剑指 Offer 47.||礼物的最大价值\t||\t1069\n" +
                    "1109.||航班预订统计\t||\t1070\n" +
                    "剑指 Offer 48.||最长不含重复字符的子字符串\t||\t1071\n" +
                    "1257.||最小公共区域\t||\t1072\n" +
                    "1872.||石子游戏 VIII\t||\t1073\n" +
                    "903.||DI 序列的有效排列\t||\t1074\n" +
                    "剑指 Offer 55 - I.||二叉树的深度\t||\t1075\n" +
                    "1057.||校园自行车分配\t||\t1076\n" +
                    "剑指 Offer 34.||二叉树中和为某一值的路径\t||\t1077\n" +
                    "剑指 Offer 27.||二叉树的镜像\t||\t1078\n" +
                    "1520.||最多的不重叠子字符串\t||\t1079\n" +
                    "854.||相似度为 K 的字符串\t||\t1080\n" +
                    "1316.||不同的循环子字符串\t||\t1081\n" +
                    "1727.||重新排列后的最大子矩阵\t||\t1082\n" +
                    "剑指 Offer 39.||数组中出现次数超过一半的数字\t||\t1083\n" +
                    "1542.||找出最长的超赞子字符串\t||\t1084\n" +
                    "1428.||至少有一个 1 的最左端列\t||\t1085\n" +
                    "1763.||最长的美好子字符串\t||\t1086\n" +
                    "1458.||两个子序列的最大点积\t||\t1087\n" +
                    "1536.||排布二进制网格的最少交换次数\t||\t1088\n" +
                    "1604.||警告一小时内使用相同员工卡大于等于三次的人\t||\t1089\n" +
                    "1671.||得到山形数组的最少删除次数\t||\t1090\n" +
                    "963.||最小面积矩形 II\t||\t1091\n" +
                    "1793.||好子数组的最大分数\t||\t1092\n" +
                    "1722.||执行交换操作后的最小汉明距离\t||\t1093\n" +
                    "1702.||修改后的最大二进制字符串\t||\t1094\n" +
                    "1125.||最小的必要团队\t||\t1095\n" +
                    "1463.||摘樱桃 II\t||\t1096\n" +
                    "1802.||有界数组中指定下标处的最大值\t||\t1097\n" +
                    "1244.||力扣排行榜\t||\t1098\n" +
                    "1150.||检查一个数是否在数组中占绝大多数\t||\t1099\n" +
                    "1106.||解析布尔表达式\t||\t1100\n" +
                    "838.||推多米诺\t||\t1101\n" +
                    "488.||祖玛游戏\t||\t1102\n" +
                    "1180.||统计只含单一字母的子串\t||\t1103\n" +
                    "面试题 17.26.||稀疏相似度\t||\t1104\n" +
                    "剑指 Offer 10- I.||斐波那契数列\t||\t1105\n" +
                    "952.||按公因数计算最大组件大小\t||\t1106\n" +
                    "1167.||连接棒材的最低费用\t||\t1107\n" +
                    "面试题 16.18.||模式匹配\t||\t1108\n" +
                    "1648.||销售价值减少的颜色球\t||\t1109\n" +
                    "1333.||餐厅过滤器\t||\t1110\n" +
                    "1322.||广告效果\t||\t1111\n" +
                    "1073.||负二进制数相加\t||\t1112\n" +
                    "940.||不同的子序列 II\t||\t1113\n" +
                    "1691.||堆叠长方体的最大高度\t||\t1114\n" +
                    "898.||子数组按位或操作\t||\t1115\n" +
                    "699.||掉落的方块\t||\t1116\n" +
                    "745.||前缀和后缀搜索\t||\t1117\n" +
                    "666.||路径总和 IV\t||\t1118\n" +
                    "LCP 04.||覆盖\t||\t1119\n" +
                    "753.||破解保险箱\t||\t1120\n" +
                    "906.||超级回文数\t||\t1121\n" +
                    "1069.||产品销售分析 II\t||\t1122\n" +
                    "675.||为高尔夫比赛砍树\t||\t1123\n" +
                    "1449.||数位成本和为目标值的最大数字\t||\t1124\n" +
                    "LCP 19.||秋叶收藏集\t||\t1125\n" +
                    "902.||最大为 N 的数字组合\t||\t1126\n" +
                    "1583.||统计不开心的朋友\t||\t1127\n" +
                    "1489.||找到最小生成树里的关键边和伪关键边\t||\t1128\n" +
                    "1680.||连接连续二进制数字\t||\t1129\n" +
                    "1745.||回文串分割 IV\t||\t1130\n" +
                    "1253.||重构 2 行二进制矩阵\t||\t1131\n" +
                    "291.||单词规律 II\t||\t1132\n" +
                    "1657.||确定两个字符串是否接近\t||\t1133\n" +
                    "1064.||不动点\t||\t1134\n" +
                    "1775.||通过最少操作次数使数组的和相等\t||\t1135\n" +
                    "866.||回文素数\t||\t1136\n" +
                    "1278.||分割回文串 III\t||\t1137\n" +
                    "466.||统计重复个数\t||\t1138\n" +
                    "1563.||石子游戏 V\t||\t1139\n" +
                    "601.||体育馆的人流量\t||\t1140\n" +
                    "1234.||替换子串得到平衡字符串\t||\t1141\n" +
                    "1665.||完成所有任务的最少初始能量\t||\t1142\n" +
                    "1328.||破坏回文串\t||\t1143\n" +
                    "LCP 22.||黑白方格画\t||\t1144\n" +
                    "1237.||找出给定方程的正整数解\t||\t1145\n" +
                    "1574.||删除最短的子数组使剩余数组有序\t||\t1146\n" +
                    "1138.||字母板上的路径\t||\t1147\n" +
                    "1362.||最接近的因数\t||\t1148\n" +
                    "502.||IPO\t||\t1149\n" +
                    "685.||冗余连接 II\t||\t1150\n" +
                    "810.||黑板异或游戏\t||\t1151\n" +
                    "855.||考场就座\t||\t1152\n" +
                    "360.||有序转化数组\t||\t1153\n" +
                    "1417.||重新格式化字符串\t||\t1154\n" +
                    "1129.||颜色交替的最短路径\t||\t1155\n" +
                    "837.||新 21 点\t||\t1156\n" +
                    "1478.||安排邮筒\t||\t1157\n" +
                    "710.||黑名单中的随机数\t||\t1158\n" +
                    "1412.||查找成绩处于中游的学生\t||\t1159\n" +
                    "1334.||阈值距离内邻居最少的城市\t||\t1160\n" +
                    "1124.||表现良好的最长时间段\t||\t1161\n" +
                    "1557.||可以到达所有点的最少点数目\t||\t1162\n" +
                    "1105.||填充书架\t||\t1163\n" +
                    "1767.||寻找没有被执行的任务对\t||\t1164\n" +
                    "1552.||两球之间的磁力\t||\t1165\n" +
                    "1711.||大餐计数\t||\t1166\n" +
                    "1777.||每家商店的产品价格\t||\t1167\n" +
                    "1135.||最低成本联通所有城市\t||\t1168\n" +
                    "1270.||向公司CEO汇报工作的所有人\t||\t1169\n" +
                    "面试题 17.11.||单词距离\t||\t1170\n" +
                    "1202.||交换字符串中的元素\t||\t1171\n" +
                    "1887.||使数组元素相等的减少操作次数\t||\t1172\n" +
                    "1006.||笨阶乘\t||\t1173\n" +
                    "565.||数组嵌套\t||\t1174\n" +
                    "775.||全局倒置与局部倒置\t||\t1175\n" +
                    "893.||特殊等价字符串组\t||\t1176\n" +
                    "744.||寻找比目标字母大的最小字母\t||\t1177\n" +
                    "916.||单词子集\t||\t1178\n" +
                    "163.||缺失的区间\t||\t1179\n" +
                    "869.||重新排序得到 2 的幂\t||\t1180\n" +
                    "1056.||易混淆数\t||\t1181\n" +
                    "面试题 04.12.||求和路径\t||\t1182\n" +
                    "1226.||哲学家进餐\t||\t1183\n" +
                    "957.||N 天后的牢房\t||\t1184\n" +
                    "1262.||可被三整除的最大和\t||\t1185\n" +
                    "970.||强整数\t||\t1186\n" +
                    "563.||二叉树的坡度\t||\t1187\n" +
                    "1529.||最少的后缀翻转次数\t||\t1188\n" +
                    "1457.||二叉树中的伪回文路径\t||\t1189\n" +
                    "1501.||可以放心投资的国家\t||\t1190\n" +
                    "1424.||对角线遍历 II\t||\t1191\n" +
                    "1055.||形成字符串的最短路径\t||\t1192\n" +
                    "590.||N 叉树的后序遍历\t||\t1193\n" +
                    "1623.||三人国家代表队\t||\t1194\n" +
                    "1241.||每个帖子的评论数\t||\t1195\n" +
                    "971.||翻转二叉树以匹配先序遍历\t||\t1196\n" +
                    "1690.||石子游戏 VII\t||\t1197\n" +
                    "1514.||概率最大的路径\t||\t1198\n" +
                    "389.||找不同\t||\t1199\n" +
                    "511.||游戏玩法分析 I\t||\t1200\n" +
                    "面试题 16.04.||井字游戏\t||\t1201\n" +
                    "244.||最短单词距离 II\t||\t1202\n" +
                    "1465.||切割后面积最大的蛋糕\t||\t1203\n" +
                    "422.||有效的单词方块\t||\t1204\n" +
                    "1736.||替换隐藏数字得到的最晚时间\t||\t1205\n" +
                    "1052.||爱生气的书店老板\t||\t1206\n" +
                    "326.||3 的幂\t||\t1207\n" +
                    "1476.||子矩形查询\t||\t1208\n" +
                    "514.||自由之路\t||\t1209\n" +
                    "LCP 12.||小张刷题计划\t||\t1210\n" +
                    "1436.||旅行终点站\t||\t1211\n" +
                    "LCP 28.||采购方案\t||\t1212\n" +
                    "1401.||圆和矩形是否有重叠\t||\t1213\n" +
                    "面试题 16.26.||计算器\t||\t1214\n" +
                    "799.||香槟塔\t||\t1215\n" +
                    "1087.||花括号展开\t||\t1216\n" +
                    "1795.||每个产品在不同商店的价格\t||\t1217\n" +
                    "1744.||你能在你最喜欢的那天吃到你最喜欢的糖果吗？\t||\t1218\n" +
                    "879.||盈利计划\t||\t1219\n" +
                    "1613.||找到遗失的ID\t||\t1220\n" +
                    "840.||矩阵中的幻方\t||\t1221\n" +
                    "1731.||每位经理的下属员工数量\t||\t1222\n" +
                    "945.||使数组唯一的最小增量\t||\t1223\n" +
                    "806.||写字符串需要的行数\t||\t1224\n" +
                    "170.||两数之和 III - 数据结构设计\t||\t1225\n" +
                    "732.||我的日程安排表 III\t||\t1226\n" +
                    "1247.||交换字符使得字符串相同\t||\t1227\n" +
                    "579.||查询员工的累计薪水\t||\t1228\n" +
                    "1394.||找出数组中的幸运数\t||\t1229\n" +
                    "LCP 02.||分式化简\t||\t1230\n" +
                    "面试题 16.01.||交换数字\t||\t1231\n" +
                    "面试题 08.07.||无重复字符串的排列组合\t||\t1232\n" +
                    "1300.||转变数组后最接近目标值的数组和\t||\t1233\n" +
                    "1364.||顾客的可信联系人数量\t||\t1234\n" +
                    "面试题 05.02.||二进制数转字符串\t||\t1235\n" +
                    "面试题 17.17.||多次搜索\t||\t1236\n" +
                    "面试题 03.06.||动物收容所\t||\t1237\n" +
                    "276.||栅栏涂色\t||\t1238\n" +
                    "615.||平均工资：部门与公司比较\t||\t1239\n" +
                    "537.||复数乘法\t||\t1240\n" +
                    "LCP 06.||拿硬币\t||\t1241\n" +
                    "596.||超过5名学生的课\t||\t1242\n" +
                    "712.||两个字符串的最小ASCII删除和\t||\t1243\n" +
                    "1507.||转变日期格式\t||\t1244\n" +
                    "1598.||文件夹操作日志搜集器\t||\t1245\n" +
                    "1356.||根据数字二进制下 1 的数目排序\t||\t1246\n" +
                    "面试题 17.10.||主要元素\t||\t1247\n" +
                    "1656.||设计有序流\t||\t1248\n" +
                    "728.||自除数\t||\t1249\n" +
                    "249.||移位字符串分组\t||\t1250\n" +
                    "989.||数组形式的整数加法\t||\t1251\n" +
                    "1313.||解压缩编码列表\t||\t1252\n" +
                    "492.||构造矩形\t||\t1253\n" +
                    "1673.||找出最具竞争力的子序列\t||\t1254\n" +
                    "793.||阶乘函数后 K 个零\t||\t1255\n" +
                    "824.||山羊拉丁文\t||\t1256\n" +
                    "820.||单词的压缩编码\t||\t1257\n" +
                    "1752.||检查数组是否经排序和轮转得到\t||\t1258\n" +
                    "1845.||座位预约管理系统\t||\t1259\n" +
                    "641.||设计循环双端队列\t||\t1260\n" +
                    "689.||三个无重叠子数组的最大和\t||\t1261\n" +
                    "1863.||找出所有子集的异或总和再求和\t||\t1262\n" +
                    "1828.||统计一个圆中点的数目\t||\t1263\n" +
                    "932.||漂亮数组\t||\t1264\n" +
                    "254.||因子的组合\t||\t1265\n" +
                    "1266.||访问所有点的最小时间\t||\t1266\n" +
                    "554.||砖墙\t||\t1267\n" +
                    "597.||好友申请 I：总体通过率\t||\t1268\n" +
                    "面试题 02.05.||链表求和\t||\t1269\n" +
                    "693.||交替位二进制数\t||\t1270\n" +
                    "面试题 08.03.||魔术索引\t||\t1271\n" +
                    "1207.||独一无二的出现次数\t||\t1272\n" +
                    "面试题 04.04.||检查平衡性\t||\t1273\n" +
                    "面试题 17.05.||字母与数字\t||\t1274\n" +
                    "1544.||整理字符串\t||\t1275\n" +
                    "面试题 02.06.||回文链表\t||\t1276\n" +
                    "面试题 04.01.||节点间通路\t||\t1277\n" +
                    "LCP 17.||速算机器人\t||\t1278\n" +
                    "1652.||拆炸弹\t||\t1279\n" +
                    "1343.||大小为 K 且平均值大于等于阈值的子数组数目\t||\t1280\n" +
                    "1305.||两棵二叉搜索树中的所有元素\t||\t1281\n" +
                    "1081.||不同字符的最小子序列\t||\t1282\n" +
                    "1408.||数组中的字符串匹配\t||\t1283\n" +
                    "1791.||找出星型图的中心节点\t||\t1284\n" +
                    "1525.||字符串的好分割数目\t||\t1285\n" +
                    "1005.||K 次取反后最大化的数组和\t||\t1286\n" +
                    "面试题 05.08.||绘制直线\t||\t1287\n" +
                    "1769.||移动所有球到每个盒子所需的最小操作数\t||\t1288\n" +
                    "1582.||二进制矩阵中的特殊位置\t||\t1289\n" +
                    "570.||至少有5名直接下属的经理\t||\t1290\n" +
                    "面试题 02.07.||链表相交\t||\t1291\n" +
                    "剑指 Offer 67.||把字符串转换成整数\t||\t1292\n" +
                    "817.||链表组件\t||\t1293\n" +
                    "1111.||有效括号的嵌套深度\t||\t1294\n" +
                    "883.||三维形体投影面积\t||\t1295\n" +
                    "1296.||划分数组为连续数字的集合\t||\t1296\n" +
                    "1399.||统计最大组的数目\t||\t1297\n" +
                    "1662.||检查两个字符串数组是否相等\t||\t1298\n" +
                    "面试题 08.01.||三步问题\t||\t1299\n" +
                    "面试题 04.02.||最小高度树\t||\t1300\n" +
                    "1873.||计算特殊奖金\t||\t1301\n" +
                    "面试题 02.08.||环路检测\t||\t1302\n" +
                    "1491.||去掉最低工资和最高工资后的工资平均值\t||\t1303\n" +
                    "1765.||地图中的最高点\t||\t1304\n" +
                    "183.||从不订购的客户\t||\t1305\n" +
                    "剑指 Offer 63.||股票的最大利润\t||\t1306\n" +
                    "剑指 Offer 18.||删除链表的节点\t||\t1307\n" +
                    "884.||两句话中的不常见单词\t||\t1308\n" +
                    "1020.||飞地的数量\t||\t1309\n" +
                    "1414.||和为 K 的最少斐波那契数字数目\t||\t1310";
}
